In [18]:
import pandas as pd

# **Combinaci√≤n de DataFrames**

## **Concatenacion**

In [19]:
data_one = { 'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3'] }

In [20]:
data_two = { 'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3'] }

In [21]:
one = pd.DataFrame(data_one)

In [22]:
two = pd.DataFrame(data_two)

In [23]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [24]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [25]:
# concatenacion por columnas
pd.concat([one, two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [26]:
# concatenacion por filas
pd.concat([one, two], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [29]:
two.columns = one.columns

In [30]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [31]:
pd.concat([one, two], axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

# **Merging**

<ul>
    <li>inner merge</li>
    <li>outer merge</li>
    <li>Left o Right merge</li>
</ul>

In [32]:
registration = pd.DataFrame( {'reg_id': [1, 2, 3, 4], 'name': ['Andrew', 'Bob','Claire', 'David']} )
login = pd.DataFrame( {'log_id': [1, 2, 3, 4], 'name': ['Xavier', 'Andrew', 'Yolanda', 'Bob']} )

In [33]:
registration

   reg_id    name
0       1  Andrew
1       2     Bob
2       3  Claire
3       4   David

In [34]:
login

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

<ul>
    <li><h2>Inner Merge</h2></li>
</ul>

In [35]:
pd.merge(registration, login, how='inner', on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2     Bob       4

In [36]:
pd.merge(login, registration, how='inner', on='name')

   log_id    name  reg_id
0       2  Andrew       1
1       4     Bob       2

<ul>
    <li><h2>Left y Right Merge</h2></li>
</ul>

<p> <em>En el caso del Left Merge y Right Merge el orden de las tablas importa </em> </p>

In [37]:
# left merge
pd.merge(left=registration, right=login, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2     Bob     4.0
2       3  Claire     NaN
3       4   David     NaN

In [38]:
pd.merge(left=login, right=registration, how='left', on='name')

   log_id     name  reg_id
0       1   Xavier     NaN
1       2   Andrew     1.0
2       3  Yolanda     NaN
3       4      Bob     2.0

In [39]:
pd.merge(left=registration, right=login, how='right', on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0      Bob       4

<ul>
    <li><h2>Outer Merge</h2></li>
</ul>

In [40]:
pd.merge(registration, login, how='outer', on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0      Bob     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [41]:
registration = registration.set_index('name')

In [42]:
registration

        reg_id
name
Andrew       1
Bob          2
Claire       3
David        4

In [43]:
login

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [45]:
pd.merge(registration, login, left_index= True, right_on= 'name', how= 'inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4     Bob

In [46]:
registration = registration.reset_index()

In [47]:
registration

     name  reg_id
0  Andrew       1
1     Bob       2
2  Claire       3
3   David       4

In [48]:
registration.columns = ['reg_name','reg_id']

In [49]:
registration

  reg_name  reg_id
0   Andrew       1
1      Bob       2
2   Claire       3
3    David       4

In [50]:
login

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [53]:
pd.merge(registration, login, how='inner', left_on='reg_name', right_on= 'name')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1      Bob       2       4     Bob

In [56]:
registration.columns = ['name', 'id']

In [57]:
registration

     name  id
0  Andrew   1
1     Bob   2
2  Claire   3
3   David   4

In [58]:
login

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [60]:
pd.merge(registration, login, how='inner', on='name', suffixes=['_reg', '_log'])

     name  id  log_id
0  Andrew   1       2
1     Bob   2       4